"""
创建字典，键由1000~9999构成，值由’1000’~’9999’构成。
即字典={ 1000 : ’1000’ , 1001 : ’1001’ , 1002 : ’1002’ , …… , 9997 : ‘9997’ , 9998 : ‘9998’ , 9999 : ‘9999’}。
计算1000~9999之间每个四位十进制数中千位、百位、十位、个位数字之和，如果和数大于30，则输出字典中相应的键值对。
例如：8779的数字之和为31，则输出8779:’8779’。又例如：5089的数字之和为22，则不输出5089的键值对。
"""
dict = {}
i = 1000
while i < 10000:
    print(i)
    dict[i] = str(i)
    a = i
    n1 = a % 10
    a = (a - n1) / 10
    n2 = a % 10
    a = (a - n2) / 10
    n3 = a % 10
    a = (a - n3) / 10
    n4 = a % 10
    if n1 + n2 + n3 + n4 > 30:
        print(i, ":", dict[i], end=", ")
    i = i + 1     
